
## :x: Apply Failed

[CI link](https://github.com/goda6565/lambda-bot/actions/runs/15225562731)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
module.secrets_manager.aws_secretsmanager_secret_version.secretmanager_secret_version["slack-signing-secret"]: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3|terraform-20250524082129799000000003]
module.api_gateway.aws_apigatewayv2_api.lambda_api: Refreshing state... [id=0pdgg6nqu1]
module.ecr.aws_ecr_repository.ecr_repository: Refreshing state... [id=lambda-bot-prod]
module.lambda.data.aws_iam_policy_document.lambda_policy_document: Reading...
module.secrets_manager.aws_secretsmanager_secret.secretsmanager_secret["slack-bot-token"]: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3]
module.secrets_manager.aws_secretsmanager_secret.secretsmanager_secret["slack-signing-secret"]: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3]
module.api_gateway.aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/aws/lambda/lambda-bot-prod-api-gateway]
module.secrets_manager.aws_secretsmanager_secret_version.secretmanager_secret_version["slack-bot-token"]: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3|terraform-20250524082129800400000004]
module.lambda.data.aws_iam_policy_document.lambda_policy_document: Read complete after 0s [id=2690255455]
module.lambda.aws_cloudwatch_log_group.lambda: Refreshing state... [id=/aws/lambda/lambda-bot-prod]
module.lambda.aws_iam_role.lambda_role: Refreshing state... [id=lambda-bot-prod-role]
module.lambda.aws_iam_role_policy_attachment.lambda_role_policy_attachment: Refreshing state... [id=lambda-bot-prod-role-20250524055713202500000001]
module.lambda.aws_iam_role_policy.lambda_secret_manager_policy: Refreshing state... [id=lambda-bot-prod-role:lambda-bot-prod-secret-manager-policy]
module.lambda.aws_lambda_function.lambda: Refreshing state... [id=lambda-bot-prod]
module.api_gateway.aws_apigatewayv2_stage.lambda_function_invoke_stage: Refreshing state... [id=$default]
module.lambda.aws_lambda_alias.lambda: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:061051222129:function:lambda-bot-prod:prod]
module.api_gateway.aws_lambda_permission.allow_apigateway: Refreshing state... [id=AllowInvokeFromApiGateway]
module.api_gateway.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=vfdjtep]
module.api_gateway.aws_apigatewayv2_route.lambda_function_route: Refreshing state... [id=n414fla]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda.data.aws_iam_policy_document.lambda_secret_manager_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_secret_manager_policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.lambda.aws_iam_role_policy.lambda_secret_manager_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda_secret_manager_policy" {
        id          = "lambda-bot-prod-role:lambda-bot-prod-secret-manager-policy"
        name        = "lambda-bot-prod-secret-manager-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3",
                          - "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "lambda-bot-prod"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:061051222129:function:lambda-bot-prod:7" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:061051222129:function:lambda-bot-prod:7/invocations" -> (known after apply)
        tags                           = {
            "Name" = "lambda-bot-prod"
        }
      ~ version                        = "7" -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "SLACK_BOT_TOKEN"      = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3" -> null
              - "SLACK_SIGNING_SECRET" = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3" -> null
                # (1 unchanged element hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.secrets_manager.aws_secretsmanager_secret.secretsmanager_secret["slack-bot-token"] will be destroyed
  # (because aws_secretsmanager_secret.secretsmanager_secret is not in configuration)
  - resource "aws_secretsmanager_secret" "secretsmanager_secret" {
      - arn                            = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3" -> null
      - name                           = "slack-bot-token" -> null
      - recovery_window_in_days        = 30 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.secrets_manager.aws_secretsmanager_secret.secretsmanager_secret["slack-signing-secret"] will be destroyed
  # (because aws_secretsmanager_secret.secretsmanager_secret is not in configuration)
  - resource "aws_secretsmanager_secret" "secretsmanager_secret" {
      - arn                            = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3" -> null
      - name                           = "slack-signing-secret" -> null
      - recovery_window_in_days        = 30 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.secrets_manager.aws_secretsmanager_secret_version.secretmanager_secret_version["slack-bot-token"] will be destroyed
  # (because aws_secretsmanager_secret_version.secretmanager_secret_version is not in configuration)
  - resource "aws_secretsmanager_secret_version" "secretmanager_secret_version" {
      - arn              = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3" -> null
      - id               = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3|terraform-20250524082129800400000004" -> null
      - secret_id        = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3" -> null
      - secret_string    = (sensitive value) -> null
      - secret_string_wo = (write-only attribute) -> null
      - version_id       = "terraform-20250524082129800400000004" -> null
      - version_stages   = [
          - "AWSPREVIOUS",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.secrets_manager.aws_secretsmanager_secret_version.secretmanager_secret_version["slack-signing-secret"] will be destroyed
  # (because aws_secretsmanager_secret_version.secretmanager_secret_version is not in configuration)
  - resource "aws_secretsmanager_secret_version" "secretmanager_secret_version" {
      - arn              = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3" -> null
      - id               = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3|terraform-20250524082129799000000003" -> null
      - secret_id        = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3" -> null
      - secret_string    = (sensitive value) -> null
      - secret_string_wo = (write-only attribute) -> null
      - version_id       = "terraform-20250524082129799000000003" -> null
      - version_stages   = [
          - "AWSPREVIOUS",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret will be created
  + resource "aws_secretsmanager_secret" "secretsmanager_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "slack-bot-token"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.slack_bot_token.aws_secretsmanager_secret_version.secretmanager_secret_version will be created
  + resource "aws_secretsmanager_secret_version" "secretmanager_secret_version" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret will be created
  + resource "aws_secretsmanager_secret" "secretsmanager_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "slack-signing-secret"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.slack_signing_secret.aws_secretsmanager_secret_version.secretmanager_secret_version will be created
  + resource "aws_secretsmanager_secret_version" "secretmanager_secret_version" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 4 to add, 2 to change, 4 to destroy.
module.secrets_manager.aws_secretsmanager_secret_version.secretmanager_secret_version["slack-signing-secret"]: Destroying... [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3|terraform-20250524082129799000000003]
module.secrets_manager.aws_secretsmanager_secret_version.secretmanager_secret_version["slack-bot-token"]: Destroying... [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3|terraform-20250524082129800400000004]
module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret: Creating...
module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret: Creating...
module.secrets_manager.aws_secretsmanager_secret_version.secretmanager_secret_version["slack-bot-token"]: Destruction complete after 0s
module.secrets_manager.aws_secretsmanager_secret_version.secretmanager_secret_version["slack-signing-secret"]: Destruction complete after 0s
module.secrets_manager.aws_secretsmanager_secret.secretsmanager_secret["slack-bot-token"]: Destroying... [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3]
module.secrets_manager.aws_secretsmanager_secret.secretsmanager_secret["slack-signing-secret"]: Destroying... [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3]
module.secrets_manager.aws_secretsmanager_secret.secretsmanager_secret["slack-bot-token"]: Destruction complete after 1s
module.secrets_manager.aws_secretsmanager_secret.secretsmanager_secret["slack-signing-secret"]: Destruction complete after 1s
module.lambda.aws_lambda_function.lambda: Modifying... [id=lambda-bot-prod]
module.lambda.aws_lambda_function.lambda: Modifications complete after 7s [id=lambda-bot-prod]
╷
│ Error: creating Secrets Manager Secret (slack-signing-secret): operation error Secrets Manager: CreateSecret, https response error StatusCode: 400, RequestID: 3f775bc7-b362-4228-a0f3-ec72d62809a2, ResourceExistsException: The operation failed because the secret slack-signing-secret already exists.
│ 
│   with module.slack_signing_secret.aws_secretsmanager_secret.secretsmanager_secret,
│   on ../../modules/secretsmanager/aws_secretsmanager_secret.tf line 1, in resource "aws_secretsmanager_secret" "secretsmanager_secret":
│    1: resource "aws_secretsmanager_secret" "secretsmanager_secret" {
│ 
╵
╷
│ Error: creating Secrets Manager Secret (slack-bot-token): operation error Secrets Manager: CreateSecret, https response error StatusCode: 400, RequestID: fdb3f27b-3e0f-4b53-9ad7-62df63fdc080, ResourceExistsException: The operation failed because the secret slack-bot-token already exists.
│ 
│   with module.slack_bot_token.aws_secretsmanager_secret.secretsmanager_secret,
│   on ../../modules/secretsmanager/aws_secretsmanager_secret.tf line 1, in resource "aws_secretsmanager_secret" "secretsmanager_secret":
│    1: resource "aws_secretsmanager_secret" "secretsmanager_secret" {
│ 
╵
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":11,"Program":"tfcmt","SHA1":"cd466584c393a322f3e9b3a08b3989cd70df4003","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->